app/controllers/admin/annonces_controller.rb

  def index
    if params[:approved] == "false"
    @annonces = Annonce.where(approved: false)
    else
    @annonces = Annonce.all
---
SELECT "annonces".* FROM "annonces" WHERE "annonces"."approved" = 'f'
SELECT "annonces".* FROM "annonces"

  def update
    @annonce = Annonce.find(params[:id])
     @annonce.update_attributes(annonce_params)
---
SELECT  "annonces".* FROM "annonces" WHERE "annonces"."id" = $1 LIMIT 1  [["id", 31]]
UPDATE "annonces" SET "approved" = $1, "updated_at" = $2 WHERE "annonces"."id" = $3  [["approved", "t"], ["updated_at", "2015-05-10 21:00:51.857270"], ["id", 31]]