app/controllers/admin/users_controller.rb

  def index
    if params[:approved] == "false"
      @users = User.where(approved: false)
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."approved" = 'f'
SELECT "users".* FROM "users"