app/controllers/annonces_controller.rb

SELECT "annonces".* FROM "annonces"
SELECT "annonces"."entreprise" FROM "annonces"
SELECT "annonces"."type_offre" FROM "annonces"
---
  def index
    @annonces = Annonce.all
    @entreprises = Annonce.select("entreprise")
    @offres = Annonce.select("type_offre")

SELECT  "annonces".* FROM "annonces" WHERE "annonces"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @annonce = Annonce.find(params[:id])

SELECT "annonces".* FROM "annonces" WHERE "annonces"."type_offre" = $1  [["type_offre", "alternance"]]
---
  def filter
    if defined?(params[:type_offre])
      @annonces = Annonce.where(type_offre: params[:type_offre])

INSERT INTO "annonces" ("entreprise", "titre", "type_offre", "description", "duree", "moyen_contact", "date_debut", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @annonce = Annonce.new(annonce_params)
    @annonce.user_id = current_user.id

    @annonce.save